import React, { useState } from "react";
import { Link } from "react-router-dom";
import "./Home.css";
import bg3 from "./img/bg3.jpg";
import bg2 from "./img/bg2.jpg";
import bg from "./img/bg.jpg";

import "react-slideshow-image/dist/styles.css";
import { sliderData } from "./sliderData";
import { Slide } from "react-slideshow-image";
import {
  IoMdArrowDroprightCircle,
  IoMdArrowDropleftCircle,
} from "react-icons/all";

import SimpleImageSlider from "react-simple-image-slider";
import FooterPage from "./FooterPage";

const Home = ({ slides }) => {
  const [current, setCurrent] = useState(0);
  const handleClick = () => {
    window.open("https://instagram.com/aamhi_gadgondhali?utm_medium=copy_link");
  };

  const sty = {
    width: "400px",
    height: "200px",
  };
  const length = slides.length;

  const nextSlide = () => {
    setCurrent(current === length - 1 ? 0 : current + 1);
  };

  const prevSlide = () => {
    setCurrent(current === 0 ? length - 1 : current - 1);
  };

  if (!Array.isArray(slides) || slides.length <= 0) {
    return null;
  }

  // const [model, setModel] = useState(false);
  // const [tempimgSc, settempimgSrc] = useState("");

  // const getImg = (image) => {
  //   settempimgSrc(image);
  //   setModel(true);
  // };

  const images = [
    { url: "./img/bg3.jpg" },
    { url: "./img/bg2.jpg" },
    { url: "./img/bg.jpg" },
  ];

  return (
    <body>
      <div className="topnav"></div>
      <div className="">
        <img className="himg" src={bg3} />
        <h1>
          <div className=" mid1">आम्ही गडगोंधळी</div>
          <div className="container">
            <div className="container1">
              {/* <img src={bg3} style={sty}></img> */}

              <section className="slider">
                <IoMdArrowDropleftCircle
                  className="left-arrow"
                  onClick={prevSlide}
                />
                <IoMdArrowDroprightCircle
                  className="right-arrow"
                  onClick={nextSlide}
                />
                {sliderData.map((slide, index) => {
                  return (
                    <div
                      className={index === current ? "slide active" : "slide"}
                      key={index}
                    >
                      {index === current && (
                        <img
                          src={slide.image}
                          alt={slide.index}
                          className="image"
                        />
                      )}
                    </div>
                  );
                })}
              </section>
              <h6>
                {"\n"}इतिहास :'जीर्णनगर', 'जुन्नेर' म्हणजेच जुन्नर हे शहर
                इसवीसनापूर्व काळापासून प्रसिद्ध आहे. जुन्नर ही शकराजा नहपानाची
                राजधानी होती. सातवाहन राजा गौतमीपुत्र सातकर्णी याने शकांचा नाश
                केला आणि जुन्नर व येथील सर्व परिसरावर आपले वर्चस्व प्रस्थापित
                केले. नाणेघाट हा पुरातन व्यापारी मार्ग, या मार्गावरून फार मोठ्या
                प्रमाणावर वाहतूक चालत असे. यावर नजर ठेवण्यासाठी या मार्गावर
                दुर्गांची निर्मीती करण्यात आली. सातवाहनांची सत्ता
                स्थिरावल्यानंतर या भागात अनेक ठिकाणी त्यांनी लेणी खोदवून घेतली.
                सातवाहनांनंतर शिवनेरी चालुक्य, राष्ट्रकूट या राजवटींच्या
                सत्तेखाली होता. इ.स. ११७० ते १३०८ च्या सुमारास यादवांनी येथे
                आपले राज्य स्थापन केले आणि याच काळात शिवनेरीला गडाचे स्वरूप
                प्राप्त झाले. नंतर इ.स. १४४३ मध्ये मलिक उत्तुजार याने यादवांचा
                पराभव करून किल्ला सर केला. अशा प्रकारे किल्ला बहमनी राजवटीखाली
                आला. इ.स. १४७० मध्ये मलिक उत्तुजार प्रतिनिधी मलिक महंमद याने
                किल्ला नाकेबंदी करून पुन्हा सर केला. १४४६ मध्ये मलिक महंमदच्या
                वडिलांच्या मृत्युनंतर निजामशाहीची स्थापना झाली. पुढे १४९३ मध्ये
                राजधानी गडावरून अहमदनगरला हलवण्यात आली. इ.स. १५६५ मध्ये सुलतान
                मूर्तिजा निजामाने आपला भाऊ कासीम याला या गडावर कैदेत ठेवले होते.
                यानंतर १५९५ मध्ये किल्ला व जुन्नर प्रांत मालोजी राजे भोसले
                यांच्याकडे आला. जिजामाता गरोदर असताना जाधारावांनी ५०० स्वार
                त्यांच्या सोबत देऊन त्यांना रातोरात शिवनेरीवर घेऊन गेले.
                ‘शिवनेरी गडावर श्रीभवानी सिवाई, तीस नवस जिजाऊने केला जे आपल्याला
                पुत्र झाला तर तुझें नांव ठेवीन, त्याऊपर शिवाजीराजे यांचा जन्म
                जाला. शके १५५६ क्षये नाम संवत्सरे वैशाख शुद्ध पंचमी चंद्रवार’.
                इ.स. १६३२ मध्ये शिवरायांनी गड सोडला आणि १६३७ मध्ये तो गड
                मोगलांच्या ताब्यात गेला. १६५० मध्ये मोगलांविरूद्ध येथील
                कोळ्यांनी बंड केले, यात मोगलांचा विजय झाला.इ.स. १६७३ मध्ये
                शिवरायांनी शिवनेरीचा किल्लेदार अजीजखान याला फितवून किल्ल्याला
                माळ लावून सर करण्याचा अयशस्वी प्रयत्न केला.इ.स. १६७८ मध्ये
                जुन्नर प्रांत लुटला गेला आणि मराठ्यांनी किल्ला घेण्याचा प्रयत्न
                केला. मात्र अपयश पदरात पडले. पुढे ४० वर्षांनंतर १७१६ मध्ये
                शाहुमहाराजांनी किल्ला मराठेशाहीत आणला व नंतर तो पेशव्यांकडे
                हस्तांतरीत करण्यात आला. पहाण्याची ठिकाणे : जुन्नरहून डांबरी
                रस्ता आपणास गडाच्या पायर्‍यांपाशी घेऊन जातो. या वाटेने गडावर
                येतांना सात दरवाजे लागतात. पहिला महादरवाजा दुसरा पीर दरवाजा
                तिसरा परवानगीचा दरवाजा, चौथा हत्ती दरवाजा, पाचवा शिपाई दरवाजा ,
                सहावा फाटक दरवाजा आणि सातवा कुलाबकर दरवाजा.सात दरवाज्यांच्या
                वाटेने गडावर येतांना पाचवा म्हणजे शिपाई दरवाजा पार केल्यावर
                मुख्य वाटसोडून उजव्या बाजूने पूढे गेल्यावर ‘शिवाई देवीचे ’ मंदिर
                लागते. मंदिराच्या मागे असणार्‍या कड्यात ६ ते ७ गुहा आहेत. या
                गुहा मुक्कामासाठी अयोग्य आहेत. मंदिरात शिवाई देवीची मूर्ती आहे.
                शेवटच्या दरवाज्यातून गडावर प्रवेश केल्यावर समोरच अंबरखाना आहे.
                आजमितिस या अंबरखान्याची मोठ्या प्रमाणात पडझड झाली आहे. मात्र
                पूर्वी या अंबरखान्याचा उपयोग धान्य साठविण्यासाठी केला जात असे.
                अंबरखान्यापासून दोन वाटा निघतात, एक वाट समोरच असणार्‍या टेकाडावर
                जाते. या टेकाडावर एक कोळी चौथरा आणि एक इदगाह आहे. दुसरी वाट
                शिवकुंजापाशी घेऊन जाते, वाटेत गंगा, जमुना व याशिवाय पाण्याची
                अनेक टाकी लागतात. जिजाउंच्या पुढ्यात असलेला बालशिवाजी, हातातील
                छोटी तलवार फिरवीत आईला आपली भव्य स्वप्ने सांगत आहे, अशा
                अविर्भावातील मायलेकरांचा पुतळा ‘शिवकुंजा’ मध्ये बसविला आहे.
                शिवकुंजासमोरच कमानी मशिद आहे आणि समोरच खाली पाण्याचे एक टाके
                आहे. येथून समोर चालत गेल्यास हमामखाना लागतो. येथूनच पुढे
                शिवजन्मस्थानाची इमारत आहे. ही इमारत दुमजली असून खालच्या खोलीत
                जिथे शिवरायांचा जन्म झाला, तेथे शिवरायांचा पुतळा बसविण्यात आला
                आहे. इमारतीच्या समोरच ‘बदामी पाण्याचे टाकं’ आहे. येथून पुढे
                जाणारा रस्ता कडेलोट टोकावर घेऊन जातो. सुमारे दिड हजार फुट उंचीचा
                ह्या सरळसोट कड्याचा उपयोग हा गुन्हेगारांना शिक्षा देण्यासाठी होत
                असे. गड फिरण्यास २ तास लागतात. किल्ल्यावरून चावंड, नाणेघाट आणि
                जीवधन तसेच समोर असणारा वडूज धरणाचा जलाशय लक्ष्य वेधून घेतो
                .पोहोचण्याच्या वाटा : गडावर जाण्याचे दोन प्रमुख मार्ग जुन्नर
                गावातूनच जातात. पुणेकरांना तसेच मुंबईकरांना एका दिवसात शिवनेरी
                पाहून घरी परतता येते.१) साखळीची वाट :- या वाटेने गडावर यायचे
                झाल्यास जुन्नर शहरात शिरल्यानंतर नव्या बसस्टँड समोरील रस्त्याने
                शिवपुतळ्यापाशी यावे. येथे चार रस्ते एकत्र मिळतात.डाव्या बाजूस
                जाणार्‍या रस्त्याने साधारणत: एक किलोमीटर गेल्यावर रस्त्याच्या
                उजव्या कडेला एक मंदिर लागते. मंदिरासमोरून जाणारी मळलेली पायवाट
                थेट शिवनेरी किल्ल्याच्या एका कातळभिंतीपाशी घेऊन जाते. भिंतीला
                लावलेल्या साखळीच्या साह्याने आणि कातळात खोदलेल्या पायर्‍यांच्या
                साह्याने वर पोहोचता येते. ही वाट थोडी अवघड असून गडावर पोहोचण्यास
                पाऊण तास लागतो. २) सात दरवाज्यांची वाट :-शिवपुतळ्यापासून डाव्या
                बाजूच्या रस्त्याने चालत सुटल्यास डांबरी रस्ता आपणास गडाच्या
                पायर्‍यांपाशी घेऊन जातो. या वाटेने गडावर येतांना सात दरवाजे
                लागतात. पहिला महादरवाजा, दुसरा पीर दरवाजा, तिसरा परवानगीचा
                दरवाजा, चौथा हत्ती दरवाजा, पाचवा शिपाई दरवाजा, सहावा फाटक दरवाजा
                आणि सातवा कुलाबकर दरवाजा. या मार्गे किल्ल्यावर पोहोचण्यासाठी दीड
                तास लागतो.३) मुंबईहून माळशेज मार्गे :- जुन्नरला येतांना माळशेज
                घाट पार केल्यावर ८ ते ९ किलोमीटरवर ‘शिवनेरी १९ किमी’ अशी एक पाटी
                रस्त्याच्या कडेला लावलेली दिसते. हा मार्ग गणेश खिंडीतून शिवनेरी
                किल्ल्यापर्यंत जातो. या मार्गाने गडावर पोहोचण्यास एक तास लागतो .
                राहाण्याची सोय :या किल्ल्यावर शिवकुंजाच्या मागील बाजूस असणार्‍या
                वर्‍हांड्यामध्ये १० ते १२ जणांची रहाण्याची सोय होते.जेवणाची सोय
                :किल्ल्यावर जेवणाची सोय नसल्याने ती व्यवस्था आपण स्वत:च
                करावी.पाण्याची सोय : गंगा व जमुना या टाक्यांमध्ये बारामही
                पिण्याचे पाणी उपलब्ध आहे. (*)जाण्यासाठी लागणारा वेळ : साखळीच्या
                मार्गे पाउण तास सात दरवाजा मार्गे दीड तास लागतो"
              </h6>
              <Link to="/district">Forts</Link>
            </div>
            <div className="container2">
              <h6>
                इतिहास :'जीर्णनगर', 'जुन्नेर' म्हणजेच जुन्नर हे शहर इसवीसनापूर्व
                काळापासून प्रसिद्ध आहे. जुन्नर ही शकराजा नहपानाची राजधानी होती.
                सातवाहन राजा गौतमीपुत्र सातकर्णी याने शकांचा नाश केला आणि जुन्नर
                व येथील सर्व परिसरावर आपले वर्चस्व प्रस्थापित केले. नाणेघाट हा
                पुरातन व्यापारी मार्ग, या मार्गावरून फार मोठ्या प्रमाणावर वाहतूक
                चालत असे. यावर नजर ठेवण्यासाठी या मार्गावर दुर्गांची निर्मीती
                करण्यात आली. सातवाहनांची सत्ता स्थिरावल्यानंतर या भागात अनेक
                ठिकाणी त्यांनी लेणी खोदवून घेतली. सातवाहनांनंतर शिवनेरी चालुक्य,
                राष्ट्रकूट या राजवटींच्या सत्तेखाली होता. इ.स. ११७० ते १३०८ च्या
                सुमारास यादवांनी येथे आपले राज्य स्थापन केले आणि याच काळात
                शिवनेरीला गडाचे स्वरूप प्राप्त झाले. नंतर इ.स. १४४३ मध्ये मलिक
                उत्तुजार याने यादवांचा पराभव करून किल्ला सर केला. अशा प्रकारे
                किल्ला बहमनी राजवटीखाली आला. इ.स. १४७० मध्ये मलिक उत्तुजार
                प्रतिनिधी मलिक महंमद याने किल्ला नाकेबंदी करून पुन्हा सर केला.
                १४४६ मध्ये मलिक महंमदच्या वडिलांच्या मृत्युनंतर निजामशाहीची
                स्थापना झाली. पुढे १४९३ मध्ये राजधानी गडावरून अहमदनगरला हलवण्यात
                आली. इ.स. १५६५ मध्ये सुलतान मूर्तिजा निजामाने आपला भाऊ कासीम
                याला या गडावर कैदेत ठेवले होते. यानंतर १५९५ मध्ये किल्ला व
                जुन्नर प्रांत मालोजी राजे भोसले यांच्याकडे आला. जिजामाता गरोदर
                असताना जाधारावांनी ५०० स्वार त्यांच्या सोबत देऊन त्यांना रातोरात
                शिवनेरीवर घेऊन गेले. ‘शिवनेरी गडावर श्रीभवानी सिवाई, तीस नवस
                जिजाऊने केला जे आपल्याला पुत्र झाला तर तुझें नांव ठेवीन, त्याऊपर
                शिवाजीराजे यांचा जन्म जाला. शके १५५६ क्षये नाम संवत्सरे वैशाख
                शुद्ध पंचमी चंद्रवार’. इ.स. १६३२ मध्ये शिवरायांनी गड सोडला आणि
                १६३७ मध्ये तो गड मोगलांच्या ताब्यात गेला. १६५० मध्ये
                मोगलांविरूद्ध येथील कोळ्यांनी बंड केले, यात मोगलांचा विजय
                झाला.इ.स. १६७३ मध्ये शिवरायांनी शिवनेरीचा किल्लेदार अजीजखान याला
                फितवून किल्ल्याला माळ लावून सर करण्याचा अयशस्वी प्रयत्न
                केला.इ.स. १६७८ मध्ये जुन्नर प्रांत लुटला गेला आणि मराठ्यांनी
                किल्ला घेण्याचा प्रयत्न केला. मात्र अपयश पदरात पडले. पुढे ४०
                वर्षांनंतर १७१६ मध्ये शाहुमहाराजांनी किल्ला मराठेशाहीत आणला व
                नंतर तो पेशव्यांकडे हस्तांतरीत करण्यात आला. पहाण्याची ठिकाणे :
                जुन्नरहून डांबरी रस्ता आपणास गडाच्या पायर्‍यांपाशी घेऊन जातो. या
                वाटेने गडावर येतांना सात दरवाजे लागतात. पहिला महादरवाजा दुसरा
                पीर दरवाजा तिसरा परवानगीचा दरवाजा, चौथा हत्ती दरवाजा, पाचवा
                शिपाई दरवाजा , सहावा फाटक दरवाजा आणि सातवा कुलाबकर दरवाजा.सात
                दरवाज्यांच्या वाटेने गडावर येतांना पाचवा म्हणजे शिपाई दरवाजा पार
                केल्यावर मुख्य वाटसोडून उजव्या बाजूने पूढे गेल्यावर ‘शिवाई
                देवीचे ’ मंदिर लागते. मंदिराच्या मागे असणार्‍या कड्यात ६ ते ७
                गुहा आहेत. या गुहा मुक्कामासाठी अयोग्य आहेत. मंदिरात शिवाई
                देवीची मूर्ती आहे. शेवटच्या दरवाज्यातून गडावर प्रवेश केल्यावर
                समोरच अंबरखाना आहे. आजमितिस या अंबरखान्याची मोठ्या प्रमाणात पडझड
                झाली आहे. मात्र पूर्वी या अंबरखान्याचा उपयोग धान्य साठविण्यासाठी
                केला जात असे. अंबरखान्यापासून दोन वाटा निघतात, एक वाट समोरच
                असणार्‍या टेकाडावर जाते. या टेकाडावर एक कोळी चौथरा आणि एक इदगाह
                आहे. दुसरी वाट शिवकुंजापाशी घेऊन जाते, वाटेत गंगा, जमुना व
                याशिवाय पाण्याची अनेक टाकी लागतात. जिजाउंच्या पुढ्यात असलेला
                बालशिवाजी, हातातील छोटी तलवार फिरवीत आईला आपली भव्य स्वप्ने
                सांगत आहे, अशा अविर्भावातील मायलेकरांचा पुतळा ‘शिवकुंजा’ मध्ये
                बसविला आहे. शिवकुंजासमोरच कमानी मशिद आहे आणि समोरच खाली पाण्याचे
                एक टाके आहे. येथून समोर चालत गेल्यास हमामखाना लागतो. येथूनच पुढे
                शिवजन्मस्थानाची इमारत आहे. ही इमारत दुमजली असून खालच्या खोलीत
                जिथे शिवरायांचा जन्म झाला, तेथे शिवरायांचा पुतळा बसविण्यात आला
                आहे. इमारतीच्या समोरच ‘बदामी पाण्याचे टाकं’ आहे. येथून पुढे
                जाणारा रस्ता कडेलोट टोकावर घेऊन जातो. सुमारे दिड हजार फुट उंचीचा
                ह्या सरळसोट कड्याचा उपयोग हा गुन्हेगारांना शिक्षा देण्यासाठी होत
                असे. गड फिरण्यास २ तास लागतात. किल्ल्यावरून चावंड, नाणेघाट आणि
                जीवधन तसेच समोर असणारा वडूज धरणाचा जलाशय लक्ष्य वेधून घेतो
                .पोहोचण्याच्या वाटा : गडावर जाण्याचे दोन प्रमुख मार्ग जुन्नर
                गावातूनच जातात. पुणेकरांना तसेच मुंबईकरांना एका दिवसात शिवनेरी
                पाहून घरी परतता येते.१) साखळीची वाट :- या वाटेने गडावर यायचे
                झाल्यास जुन्नर शहरात शिरल्यानंतर नव्या बसस्टँड समोरील रस्त्याने
                शिवपुतळ्यापाशी यावे. येथे चार रस्ते एकत्र मिळतात.डाव्या बाजूस
                जाणार्‍या रस्त्याने साधारणत: एक किलोमीटर गेल्यावर रस्त्याच्या
                उजव्या कडेला एक मंदिर लागते. मंदिरासमोरून जाणारी मळलेली पायवाट
                थेट शिवनेरी किल्ल्याच्या एका कातळभिंतीपाशी घेऊन जाते. भिंतीला
                लावलेल्या साखळीच्या साह्याने आणि कातळात खोदलेल्या पायर्‍यांच्या
                साह्याने वर पोहोचता येते. ही वाट थोडी अवघड असून गडावर पोहोचण्यास
                पाऊण तास लागतो. २) सात दरवाज्यांची वाट :-शिवपुतळ्यापासून डाव्या
                बाजूच्या रस्त्याने चालत सुटल्यास डांबरी रस्ता आपणास गडाच्या
                पायर्‍यांपाशी घेऊन जातो. या वाटेने गडावर येतांना सात दरवाजे
                लागतात. पहिला महादरवाजा, दुसरा पीर दरवाजा, तिसरा परवानगीचा
                दरवाजा, चौथा हत्ती दरवाजा, पाचवा शिपाई दरवाजा, सहावा फाटक दरवाजा
                आणि सातवा कुलाबकर दरवाजा. या मार्गे किल्ल्यावर पोहोचण्यासाठी दीड
                तास लागतो.३) मुंबईहून माळशेज मार्गे :- जुन्नरला येतांना माळशेज
                घाट पार केल्यावर ८ ते ९ किलोमीटरवर ‘शिवनेरी १९ किमी’ अशी एक पाटी
                रस्त्याच्या कडेला लावलेली दिसते. हा मार्ग गणेश खिंडीतून शिवनेरी
                किल्ल्यापर्यंत जातो. या मार्गाने गडावर पोहोचण्यास एक तास लागतो .
                राहाण्याची सोय :या किल्ल्यावर शिवकुंजाच्या मागील बाजूस असणार्‍या
                वर्‍हांड्यामध्ये १० ते १२ जणांची रहाण्याची सोय होते.जेवणाची सोय
                :किल्ल्यावर जेवणाची सोय नसल्याने ती व्यवस्था आपण स्वत:च
                करावी.पाण्याची सोय : गंगा व जमुना या टाक्यांमध्ये बारामही
                पिण्याचे पाणी उपलब्ध आहे. (*)जाण्यासाठी लागणारा वेळ : साखळीच्या
                मार्गे पाउण तास सात दरवाजा मार्गे दीड तास लागतो"
              </h6>
            </div>
          </div>
        </h1>
      </div>
      <FooterPage></FooterPage>
    </body>
  );
};

export default Home;
